; domain
(define (domain miconic)
  (:requirements :strips)
  (:types passenger - object
          floor - object
         )

(:predicates 
(origin ?person - passenger ?floor - floor)
;; entry of ?person is ?floor
;; inertia

(destin ?person - passenger ?floor - floor)
;; exit of ?person is ?floor
;; inertia

(above ?floor1 - floor  ?floor2 - floor)
;; ?floor2 is located above of ?floor1

(boarded ?person - passenger)
;; true if ?person has boarded the lift

(not-boarded ?person - passenger)
;; true if ?person has not boarded the lift

(served ?person - passenger)
;; true if ?person has alighted as her destination

(not-served ?person - passenger)
;; true if ?person is not at their destination

(lift-at ?floor - floor)
;; current position of the lift is at ?floor
)


;;stop and allow boarding

(:action board
  :parameters (?f - floor ?p - passenger)
  :precondition (and (lift-at ?f) (origin ?p ?f))
  :effect (boarded ?p))

(:action depart
  :parameters (?f - floor ?p - passenger)
  :precondition (and (lift-at ?f) (destin ?p ?f)
		     (boarded ?p))
  :effect (and (not (boarded ?p))
	       (served ?p)))
;;drive up

(:action up
  :parameters (?f1 - floor ?f2 - floor)
  :precondition (and (lift-at ?f1) (above ?f1 ?f2))
  :effect (and (lift-at ?f2) (not (lift-at ?f1))))


;;drive down

(:action down
  :parameters (?f1 - floor ?f2 - floor)
  :precondition (and (lift-at ?f1) (above ?f2 ?f1))
  :effect (and (lift-at ?f2) (not (lift-at ?f1))))
)

; problem
(define (problem mixed-f21-p18-u0-v0-d0-a0-n0-A0-B0-N0-F0)
   (:domain miconic)
   (:objects p0 p1 p2 p3 p4 p5 p6 p7 p8 p9 
             p10 p11 p12 p13 p14 p15 p16 p17 - passenger
             f0 f1 f2 f3 f4 f5 f6 f7 f8 f9 
             f10 f11 f12 f13 f14 f15 f16 f17 f18 f19 
             f20 - floor)


(:init
(above f0 f1)
(above f0 f2)
(above f0 f3)
(above f0 f4)
(above f0 f5)
(above f0 f6)
(above f0 f7)
(above f0 f8)
(above f0 f9)
(above f0 f10)
(above f0 f11)
(above f0 f12)
(above f0 f13)
(above f0 f14)
(above f0 f15)
(above f0 f16)
(above f0 f17)
(above f0 f18)
(above f0 f19)
(above f0 f20)

(above f1 f2)
(above f1 f3)
(above f1 f4)
(above f1 f5)
(above f1 f6)
(above f1 f7)
(above f1 f8)
(above f1 f9)
(above f1 f10)
(above f1 f11)
(above f1 f12)
(above f1 f13)
(above f1 f14)
(above f1 f15)
(above f1 f16)
(above f1 f17)
(above f1 f18)
(above f1 f19)
(above f1 f20)

(above f2 f3)
(above f2 f4)
(above f2 f5)
(above f2 f6)
(above f2 f7)
(above f2 f8)
(above f2 f9)
(above f2 f10)
(above f2 f11)
(above f2 f12)
(above f2 f13)
(above f2 f14)
(above f2 f15)
(above f2 f16)
(above f2 f17)
(above f2 f18)
(above f2 f19)
(above f2 f20)

(above f3 f4)
(above f3 f5)
(above f3 f6)
(above f3 f7)
(above f3 f8)
(above f3 f9)
(above f3 f10)
(above f3 f11)
(above f3 f12)
(above f3 f13)
(above f3 f14)
(above f3 f15)
(above f3 f16)
(above f3 f17)
(above f3 f18)
(above f3 f19)
(above f3 f20)

(above f4 f5)
(above f4 f6)
(above f4 f7)
(above f4 f8)
(above f4 f9)
(above f4 f10)
(above f4 f11)
(above f4 f12)
(above f4 f13)
(above f4 f14)
(above f4 f15)
(above f4 f16)
(above f4 f17)
(above f4 f18)
(above f4 f19)
(above f4 f20)

(above f5 f6)
(above f5 f7)
(above f5 f8)
(above f5 f9)
(above f5 f10)
(above f5 f11)
(above f5 f12)
(above f5 f13)
(above f5 f14)
(above f5 f15)
(above f5 f16)
(above f5 f17)
(above f5 f18)
(above f5 f19)
(above f5 f20)

(above f6 f7)
(above f6 f8)
(above f6 f9)
(above f6 f10)
(above f6 f11)
(above f6 f12)
(above f6 f13)
(above f6 f14)
(above f6 f15)
(above f6 f16)
(above f6 f17)
(above f6 f18)
(above f6 f19)
(above f6 f20)

(above f7 f8)
(above f7 f9)
(above f7 f10)
(above f7 f11)
(above f7 f12)
(above f7 f13)
(above f7 f14)
(above f7 f15)
(above f7 f16)
(above f7 f17)
(above f7 f18)
(above f7 f19)
(above f7 f20)

(above f8 f9)
(above f8 f10)
(above f8 f11)
(above f8 f12)
(above f8 f13)
(above f8 f14)
(above f8 f15)
(above f8 f16)
(above f8 f17)
(above f8 f18)
(above f8 f19)
(above f8 f20)

(above f9 f10)
(above f9 f11)
(above f9 f12)
(above f9 f13)
(above f9 f14)
(above f9 f15)
(above f9 f16)
(above f9 f17)
(above f9 f18)
(above f9 f19)
(above f9 f20)

(above f10 f11)
(above f10 f12)
(above f10 f13)
(above f10 f14)
(above f10 f15)
(above f10 f16)
(above f10 f17)
(above f10 f18)
(above f10 f19)
(above f10 f20)

(above f11 f12)
(above f11 f13)
(above f11 f14)
(above f11 f15)
(above f11 f16)
(above f11 f17)
(above f11 f18)
(above f11 f19)
(above f11 f20)

(above f12 f13)
(above f12 f14)
(above f12 f15)
(above f12 f16)
(above f12 f17)
(above f12 f18)
(above f12 f19)
(above f12 f20)

(above f13 f14)
(above f13 f15)
(above f13 f16)
(above f13 f17)
(above f13 f18)
(above f13 f19)
(above f13 f20)

(above f14 f15)
(above f14 f16)
(above f14 f17)
(above f14 f18)
(above f14 f19)
(above f14 f20)

(above f15 f16)
(above f15 f17)
(above f15 f18)
(above f15 f19)
(above f15 f20)

(above f16 f17)
(above f16 f18)
(above f16 f19)
(above f16 f20)

(above f17 f18)
(above f17 f19)
(above f17 f20)

(above f18 f19)
(above f18 f20)

(above f19 f20)



(origin p0 f15)
(destin p0 f20)

(origin p1 f20)
(destin p1 f13)

(origin p2 f7)
(destin p2 f19)

(origin p3 f2)
(destin p3 f11)

(origin p4 f7)
(destin p4 f12)

(origin p5 f12)
(destin p5 f10)

(origin p6 f5)
(destin p6 f1)

(origin p7 f13)
(destin p7 f0)

(origin p8 f17)
(destin p8 f18)

(origin p9 f11)
(destin p9 f3)

(origin p10 f12)
(destin p10 f13)

(origin p11 f9)
(destin p11 f15)

(origin p12 f3)
(destin p12 f19)

(origin p13 f11)
(destin p13 f7)

(origin p14 f19)
(destin p14 f1)

(origin p15 f7)
(destin p15 f11)

(origin p16 f0)
(destin p16 f4)

(origin p17 f1)
(destin p17 f7)






(lift-at f0)
)


(:goal


(and
(served p0)
(served p1)
(served p2)
(served p3)
(served p4)
(served p5)
(served p6)
(served p7)
(served p8)
(served p9)
(served p10)
(served p11)
(served p12)
(served p13)
(served p14)
(served p15)
(served p16)
(served p17)
))
)

; plan
1. (up f0 f9)
   deleted: (lift-at f0)
   added: (lift-at f9)
   goals met: 0 of 18
2. (board f9 p11)
   added: (boarded p11)
   goals met: 0 of 18
3. (down f9 f7)
   deleted: (lift-at f9)
   added: (lift-at f7)
   goals met: 0 of 18
4. (board f7 p4)
   added: (boarded p4)
   goals met: 0 of 18
5. (board f7 p2)
   added: (boarded p2)
   goals met: 0 of 18
6. (board f7 p15)
   added: (boarded p15)
   goals met: 0 of 18
7. (down f7 f2)
   deleted: (lift-at f7)
   added: (lift-at f2)
   goals met: 0 of 18
8. (board f2 p3)
   added: (boarded p3)
   goals met: 0 of 18
9. (up f2 f15)
   deleted: (lift-at f2)
   added: (lift-at f15)
   goals met: 0 of 18
10. (depart f15 p11)
   deleted: (boarded p11)
   added: (served p11)
   goals met: 1 of 18
11. (board f15 p0)
   added: (boarded p0)
   goals met: 1 of 18
12. (down f15 f12)
   deleted: (lift-at f15)
   added: (lift-at f12)
   goals met: 1 of 18
13. (depart f12 p4)
   deleted: (boarded p4)
   added: (served p4)
   goals met: 2 of 18
14. (board f12 p5)
   added: (boarded p5)
   goals met: 2 of 18
15. (board f12 p10)
   added: (boarded p10)
   goals met: 2 of 18
16. (down f12 f11)
   deleted: (lift-at f12)
   added: (lift-at f11)
   goals met: 2 of 18
17. (depart f11 p3)
   deleted: (boarded p3)
   added: (served p3)
   goals met: 3 of 18
18. (depart f11 p15)
   deleted: (boarded p15)
   added: (served p15)
   goals met: 4 of 18
19. (board f11 p9)
   added: (boarded p9)
   goals met: 4 of 18
20. (board f11 p13)
   added: (boarded p13)
   goals met: 4 of 18
21. (down f11 f10)
   deleted: (lift-at f11)
   added: (lift-at f10)
   goals met: 4 of 18
22. (depart f10 p5)
   deleted: (boarded p5)
   added: (served p5)
   goals met: 5 of 18
23. (down f10 f3)
   deleted: (lift-at f10)
   added: (lift-at f3)
   goals met: 5 of 18
24. (board f3 p12)
   added: (boarded p12)
   goals met: 5 of 18
25. (depart f3 p9)
   deleted: (boarded p9)
   added: (served p9)
   goals met: 6 of 18
26. (up f3 f17)
   deleted: (lift-at f3)
   added: (lift-at f17)
   goals met: 6 of 18
27. (board f17 p8)
   added: (boarded p8)
   goals met: 6 of 18
28. (down f17 f5)
   deleted: (lift-at f17)
   added: (lift-at f5)
   goals met: 6 of 18
29. (board f5 p6)
   added: (boarded p6)
   goals met: 6 of 18
30. (up f5 f18)
   deleted: (lift-at f5)
   added: (lift-at f18)
   goals met: 6 of 18
31. (depart f18 p8)
   deleted: (boarded p8)
   added: (served p8)
   goals met: 7 of 18
32. (up f18 f19)
   deleted: (lift-at f18)
   added: (lift-at f19)
   goals met: 7 of 18
33. (board f19 p14)
   added: (boarded p14)
   goals met: 7 of 18
34. (depart f19 p12)
   deleted: (boarded p12)
   added: (served p12)
   goals met: 8 of 18
35. (depart f19 p2)
   deleted: (boarded p2)
   added: (served p2)
   goals met: 9 of 18
36. (down f19 f1)
   deleted: (lift-at f19)
   added: (lift-at f1)
   goals met: 9 of 18
37. (board f1 p17)
   added: (boarded p17)
   goals met: 9 of 18
38. (depart f1 p14)
   deleted: (boarded p14)
   added: (served p14)
   goals met: 10 of 18
39. (depart f1 p6)
   deleted: (boarded p6)
   added: (served p6)
   goals met: 11 of 18
40. (up f1 f20)
   deleted: (lift-at f1)
   added: (lift-at f20)
   goals met: 11 of 18
41. (board f20 p1)
   added: (boarded p1)
   goals met: 11 of 18
42. (depart f20 p0)
   deleted: (boarded p0)
   added: (served p0)
   goals met: 12 of 18
43. (down f20 f13)
   deleted: (lift-at f20)
   added: (lift-at f13)
   goals met: 12 of 18
44. (board f13 p7)
   added: (boarded p7)
   goals met: 12 of 18
45. (depart f13 p1)
   deleted: (boarded p1)
   added: (served p1)
   goals met: 13 of 18
46. (depart f13 p10)
   deleted: (boarded p10)
   added: (served p10)
   goals met: 14 of 18
47. (down f13 f0)
   deleted: (lift-at f13)
   added: (lift-at f0)
   goals met: 14 of 18
48. (board f0 p16)
   added: (boarded p16)
   goals met: 14 of 18
49. (depart f0 p7)
   deleted: (boarded p7)
   added: (served p7)
   goals met: 15 of 18
50. (up f0 f4)
   deleted: (lift-at f0)
   added: (lift-at f4)
   goals met: 15 of 18
51. (depart f4 p16)
   deleted: (boarded p16)
   added: (served p16)
   goals met: 16 of 18
52. (up f4 f7)
   deleted: (lift-at f4)
   added: (lift-at f7)
   goals met: 16 of 18
53. (depart f7 p13)
   deleted: (boarded p13)
   added: (served p13)
   goals met: 17 of 18
54. (depart f7 p17)
   deleted: (boarded p17)
   added: (served p17)
   goals met: 18 of 18
